{"data":{"markdownRemark":{"html":"<h1>บันทึกความพยายามในการลดใช้โทรศัพท์มือถือ</h1>\n<p>ทุกๆครั้งที่ผมหยิบโทรศัพท์มือถือขึ้นมา ผมมักจะมีเหตุผลเสมอนะว่าผมหยิบมันขึ้นมาเพื่อจะทำอะไร ไม่ว่าจะเป็น หยิบมาอ่านนิวฟีดของเฟสบุ๊ค, หยิบมาอ่านบทความ, หยิบมาฟังเพลง ฯลฯ ผมมักจะหยิบโทรศัพท์มือถือมาด้วยความตั้งใจอย่างหนึ่งเสมอ</p>\n<p>แต่มีอยู่วันนึง ในขณะที่ผมนั่งทำงานไปได้สักพัก มือขวาของผมเอื้อมไปหยิบโทรศัพท์มือถือโดยอัตโนมัติ และหลังจากที่ผมปลดล็อคโทรศัพท์มือถือมือถือเสร็จ เหมือนได้สติกลับคืนมา และคำถามแรกที่แว๊บเข้ามาในหัวทันทีเลยก็คือ</p>\n<p>“กูหยิบมือถือขึ้นมาทำอะไรวะ ?”</p>\n<p>ผมทำมันโดยอัตโนมัติ และเริ่มหาเหตุผลในการหยิบโทรศัพท์มือถือแต่ละครั้งไม่ได้แล้ว หลายๆครั้งรู้สึกตัวอีกทีคือเรากำลังเล่นมันอยู่ ไม่ว่าจะเป็นบนรถไฟฟ้า, ระหว่างเดินทาง หรือแม้แต่ขนาดปิดไฟจะนอนก็ยังไม่วายจะเล่น นั่นเป็นสัญญาณของคนติดโทรศัพท์มือถือหรือเปล่านะ ?</p>\n<h2>เราใช้เวลาไปกับโทรศัพท์มือถือเท่าไหร่ ?</h2>\n<p>เริ่มต้นผมตรวจสอบตัวเองดังนี้</p>\n<ul>\n<li>เนื่องจากผมใช้ iOS เลยลองเข้าไปที่ Settings -> Screen Time ด้านในจะมีสถิติว่าเราเล่นโทรศัพท์มือถือวันละกี่ชั่วโมง, หยิบโทรศัพท์มือถือวันละกี่ครั้ง, เล่นแอพอะไรบ้าง กี่นาที ซึ่งจากสถิติเนี่ย ผมเล่นโทรศัพท์มือถือเฉลี่ยวันละ 4 ชั่วโมง, หยิบโทรศัพท์ 78 ครั้งต่อวัน คุณพระ!!! รู้สึกเสียดายเวลาขึ้นมาทันที</li>\n<li>ในเฟสบุ๊คก็ดูได้ผ่านแท็บ Your Time on Facebook นะครับ ของผมเฉลี่ยอยู่ที่วันละชั่วโมงนิดๆ</li>\n</ul>\n<p>จากเหตุการณ์ทั้งหมด ผมสรุปกับตัวเองว่า ผมเล่นโทรศัพท์มือถือเยอะเกินไปแล้วแหละ</p>\n<h2>ตั้งเป้าหมาย</h2>\n<ul>\n<li>ผมจะลดค่าเฉลี่ยของการเล่นโทรศัพท์มือถือ 4 ชั่วโมงต่อวัน ให้เหลือ 3 ชั่วโมงต่อวัน แล้วเอาเวลา 1 ชั่วโมงไปทำอย่างอื่น</li>\n<li>ผมจะลดค่าเฉลี่ยของการหยิบโทรศัพท์มือถือจาก 78 ครั้งต่อวัน ให้เหลือสัก 60 ครั้งต่อวัน และพยายามไม่หยิบมือถือในช่วงเวลาที่ควรจะโฟกัส</li>\n</ul>\n<h2>ลงมือทำ</h2>\n<p>จริงๆแล้วทั้งใน iOS และเฟสบุ๊คก็สามารถจำกัดเวลาในการเล่นโทรศัพท์มือถือได้นะ แต่ผมไปเจอแอพตัวนึงชื่อว่า “Forest” เห็นว่าน่าสนใจดี เลยจัดมาในราคา 69 บาท ด้วยแนวคิดที่ว่า “ไม่เสียตังค์ ไม่ตั้งใจ” ฮ่าๆ</p>\n<h2>Forest</h2>\n<p>ออกตัวก่อนนะครับว่าไม่ใช่หน้าม้า 55</p>\n<p>การใช้งานก็เข้าใจง่ายมากครับ ถ้าเกิดเราอยากมีสมาธิหรืออยากหยุดเล่นโทรศัพท์มือถือ ให้เราเลือกเวลาเลยครับว่าอยากจะโฟกัสกี่นาทีและเลือกชนิดของต้นไม้ที่จะปลูก จากนั้นก็วางโทรศัพท์มือถือแล้วไปทำอย่างอื่นซะ แค่นั้นครับ</p>\n<p>ระหว่างนั้นก็คิดซะว่าเรากำลังปลูกป่าครับ ถ้าเราไม่เล่นโทรศัพท์มือถือ ต้นไม้ที่เราปลูกไว้ก็จะค่อยๆโตขึ้นเรื่อยๆ จนกว่าจะครบเวลาที่ตั้งไว้ครับ แต่ถ้าหากเราปลดล็อคโทรศัพท์มือถือขึ้นมาเล่นเนี่ย ต้นไม้ที่เราปลูกก็จะตายทันที กลายเป็นป่าของเราก็จะมีต้นไม้ตายแทรกอยู่ในนั้น (แต่ถ้าเปิดมาแล้วรีบปิดทันทีก็ยังได้อยู่นะ)</p>\n<p>ซึ่งเราก็สามารถจะดูสถิติจากในแอพนี้ได้เช่นกัน ว่าโฟกัสไปกี่นาที, หยิบมือถือมาเล่นกี่ครั้ง</p>\n<h2>หลังจากใช้งานไปได้เกือบๆเดือน</h2>\n<p>จากเป้าหมายที่ตั้งเอาไว้</p>\n<ul>\n<li>ลดเวลาการเล่น</li>\n<li>ลดจำนวนการหยิบ</li>\n</ul>\n<p>และผมคิดว่าผมได้อะไรหลายๆอย่างนอกจากที่ตั้งใจไว้อีกนะ</p>\n<ul>\n<li>ผมใช้เวลากินข้าวน้อยลงนะ ปกติแล้วผมใช้เวลาราวๆ 20-30 นาที ในการกินข้าวไปเล่นโทรศัพท์มือถือไป แถมไม่ได้รู้สึกว่าได้พักผ่อนด้วยนะ ทั้งๆที่เล่นโทรศัพท์มือถืออยู่แท้ๆ แต่พอใช้แอพผมสามารถกินข้าวเสร็จภายใน 10 นาที พร้อมกับได้เวลาเหลือๆมาเพื่อเอาไปพักผ่อนอีกด้วย</li>\n<li>ได้งานอดิเรกเพิ่ม ในช่วงเวลาที่เดินเท้าไปไหนมาไหน ผมพยายามเลี่ยงการเล่นโทรศัพท์มือถือนะ แล้วใช้วิธีฟังพอดแคสแทน โดยดูว่าพอดแคสที่จะฟังเนี่ยใช้เวลากี่นาที แล้วก็เลือกเวลาโฟกัสไปตามนั้น แล้วก็ไม่หยิบโทรศัพท์มือถือมาเล่นระหว่างเดินเท้านะ ได้ฟังอะไรเพลินๆแถมไม่รบกวนคนที่เดินรอบข้างด้วย</li>\n<li>เลิกเล่นโทรศัพท์มือถือตอนปิดไฟนอนได้แล้ว ปกติแม้ว่าผมจะปิดไฟเตรียมนอนแล้ว แต่ผมก็ยังอดเล่นโทรศัพท์มือถือก่อนนอนไม่ได้อยู่ดี แต่เดี๋ยวนี้ผมไม่ได้เล่นโทรศัพท์มือถือแล้ว แถมได้เวลานอนเพิ่มมาอีกวันละเกือบๆ 1 ชั่วโมงอีกด้วย</li>\n</ul>\n<p>สุดท้ายแล้ว นี่เป็นแค่อีกหนึ่งประสบการณ์ของผมเท่านั้นนะครับ ผมแค่อยากแบ่งปันสิ่งที่ผมพบเจอมาเท่านั้น หากใครมีวิธีที่ดีกว่าหรือมีข้อโต้แย้ง ข้อแนะนำ สามารถพูดคุยแบ่งปันประสบการณ์กันได้นะครับ แล้วเจอกันใหม่บทความหน้า สวัสดีครับ</p>","frontmatter":{"title":"Pandas and Bananas"}}},"pageContext":{"slug":"/บันทึกความพยายามในการลดใช้โทรศัพท์มือถือ/"}}